In [8]:
import pandas as pd
df = pd.read_csv('Csvtest.csv', encoding='euc-kr')
df.head()

    이름  학번  국어  수학  영어  합계  평균  석차
0  홍길동   1  90  85  60 NaN NaN NaN
1  강감찬   2  85  75  65 NaN NaN NaN
2  나원참   3  78  83  95 NaN NaN NaN
3  이순신   4  90  95  90 NaN NaN NaN
4  나홀로   5  88  72  70 NaN NaN NaN

In [9]:
category = df.groupby('이름')
grouped_by_category = df.groupby('이름')
gildong = grouped_by_category.get_group('홍길동')
print(gildong)

    이름  학번  국어  수학  영어  합계  평균  석차
0  홍길동   1  90  85  60 NaN NaN NaN

In [10]:
a = df["국어"]
b = df["수학"]
c = df["영어"]

print(a)
print(b)
print(c)

0    90
1    85
2    78
3    90
4    88
5    88
6    69
7    79
8    88
9    88
Name: 국어, dtype: int64
0    85
1    75
2    83
3    95
4    72
5    92
6    78
7    96
8    56
9    96
Name: 수학, dtype: int64
0    60
1    65
2    95
3    90
4    70
5    99
6    77
7    90
8    45
9    66
Name: 영어, dtype: int64

In [11]:
sum = a+b+c
print(sum)

0    235
1    225
2    256
3    275
4    230
5    279
6    224
7    265
8    189
9    250
dtype: int64

In [12]:
mean = sum/3
print(mean)

0    78.333333
1    75.000000
2    85.333333
3    91.666667
4    76.666667
5    93.000000
6    74.666667
7    88.333333
8    63.000000
9    83.333333
dtype: float64

In [13]:
df['합계'] = sum
print(df)

    이름  학번  국어  수학  영어   합계  평균  석차
0  홍길동   1  90  85  60  235 NaN NaN
1  강감찬   2  85  75  65  225 NaN NaN
2  나원참   3  78  83  95  256 NaN NaN
3  이순신   4  90  95  90  275 NaN NaN
4  나홀로   5  88  72  70  230 NaN NaN
5  태평양   6  88  92  99  279 NaN NaN
6  대서양   7  69  78  77  224 NaN NaN
7  인도양   8  79  96  90  265 NaN NaN
8  백두산   9  88  56  45  189 NaN NaN
9  한라산  10  88  96  66  250 NaN NaN

In [14]:
df['평균'] = mean
print(df)

    이름  학번  국어  수학  영어   합계         평균  석차
0  홍길동   1  90  85  60  235  78.333333 NaN
1  강감찬   2  85  75  65  225  75.000000 NaN
2  나원참   3  78  83  95  256  85.333333 NaN
3  이순신   4  90  95  90  275  91.666667 NaN
4  나홀로   5  88  72  70  230  76.666667 NaN
5  태평양   6  88  92  99  279  93.000000 NaN
6  대서양   7  69  78  77  224  74.666667 NaN
7  인도양   8  79  96  90  265  88.333333 NaN
8  백두산   9  88  56  45  189  63.000000 NaN
9  한라산  10  88  96  66  250  83.333333 NaN

In [15]:
df['석차'] = df['합계'].rank(ascending=False)
print(df)

    이름  학번  국어  수학  영어   합계         평균    석차
0  홍길동   1  90  85  60  235  78.333333   6.0
1  강감찬   2  85  75  65  225  75.000000   8.0
2  나원참   3  78  83  95  256  85.333333   4.0
3  이순신   4  90  95  90  275  91.666667   2.0
4  나홀로   5  88  72  70  230  76.666667   7.0
5  태평양   6  88  92  99  279  93.000000   1.0
6  대서양   7  69  78  77  224  74.666667   9.0
7  인도양   8  79  96  90  265  88.333333   3.0
8  백두산   9  88  56  45  189  63.000000  10.0
9  한라산  10  88  96  66  250  83.333333   5.0

In [18]:
df.to_csv(r'C:\Users\BSH\min\fn\rank.csv', encoding='euc-kr')